# InvalidOperationException Class (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
InvalidOperationException Class
Members See Also
---
The exception that is thrown when a method call is invalid for the object's current state.
**Namespace:** Autodesk.Revit.Exceptions**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
[SerializableAttribute]
public class InvalidOperationException : ApplicationException
```

Visual Basic
---
```text
<SerializableAttribute> _
Public Class InvalidOperationException _
	Inherits ApplicationException
```

Visual C++
---
```text
[SerializableAttribute]
public ref class InvalidOperationException : public ApplicationException
```

# Inheritance Hierarchy
System..::..Object System..::..Exception Autodesk.Revit.Exceptions..::..ApplicationException Autodesk.Revit.Exceptions..::..InvalidOperationException Autodesk.Revit.Exceptions..::..AutoJoinFailedException Autodesk.Revit.Exceptions..::..CannotOpenBothCentralAndLocalException Autodesk.Revit.Exceptions..::..DisabledDisciplineException Autodesk.Revit.Exceptions..::..FamilyContextException Autodesk.Revit.Exceptions..::..ForbiddenForDynamicUpdateException Autodesk.Revit.Exceptions..::..InapplicableDataException Autodesk.Revit.Exceptions..::..InsufficientResourcesException Autodesk.Revit.Exceptions..::..InvalidObjectException Autodesk.Revit.Exceptions..::..ModificationForbiddenException Autodesk.Revit.Exceptions..::..ModificationOutsideTransactionException Autodesk.Revit.Exceptions..::..NotTransmittedModelException Autodesk.Revit.Exceptions..::..ObjectAccessException Autodesk.Revit.Exceptions..::..OptionalFunctionalityNotAvailableException Autodesk.Revit.Exceptions..::..RegenerationFailedException Autodesk.Revit.Exceptions..::..TransientElementCreationException Autodesk.Revit.Exceptions..::..TransmittedModelException Autodesk.Revit.Exceptions..::..WrongUserException
# See Also
InvalidOperationException Members
Autodesk.Revit.Exceptions Namespace